app/views/users/show.html.erb

      <hr>
    <% if @user.results.last %>
---
SELECT  "results".* FROM "results" WHERE "results"."user_id" = ?  ORDER BY "results"."id" DESC LIMIT 1  [["user_id", 1]]