app/views/home/index.html.erb

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."information_id" = ?  ORDER BY "tickets"."id" ASC LIMIT 1  [["information_id", 4]]
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."user_id" = ? AND "tickets"."information_id" = ? LIMIT 1  [["user_id", 2], ["information_id", 3]]
---
            <%= link_to '削除', information_path(e),class: 'btn btn-danger',method: :delete, data: {confirm: '本当に削除しますか？'} %>
            <%= link_to '参加者一覧' ,information_tickets_path(e),class:'btn btn-primary' if e.tickets.first%>
            <%= '申し込み期限' + e.expire_date.strftime('%Y年%m月%d日') if e.participate?%>
          <% elsif e.participate && current_user.tickets.find_by(information_id: e)%>