app/views/tickets/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
    <div class="panel panel-default">
      <div class="panel-heading"> <%= '参加者氏名:    ' + User.find(e.user_id).name %>