app/controllers/admin_controller.rb

SELECT  "users".* FROM "users" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @user = User.page(params[:page]).per(PER).all

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def show
    if current_user.admin?
      @user = User.find(params[:id])