app/controllers/home_controller.rb

  def index
    @info = Information.page(params[:page]).per(PER).all.order('updated_at DESC')
---
SELECT  "information".* FROM "information"  ORDER BY updated_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "information"