app/controllers/home_controller.rb

SELECT  "information".* FROM "information"  ORDER BY created_at DESC LIMIT 5 OFFSET 0
---
  def index
    @info = Information.page(params[:page]).order('created_at DESC')