app/controllers/information_controller.rb

  def create
    @info = Information.create(info_params)
---
INSERT INTO "information" ("title", "content", "participate", "expire_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def edit
    @info = Information.find(params[:id])
---
SELECT  "information".* FROM "information" WHERE "information"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @info = Information.find(params[:id])
    if @info.update(info_params)
---
SELECT  "information".* FROM "information" WHERE "information"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "information" SET "start_date" = ?, "expire_date" = ?, "updated_at" = ? WHERE "information"."id" = ?  [["start_date", "2016-03-03 12:27:00.000000"], ["expire_date", "2016-03-03 12:22:00.000000"], ["updated_at", "2016-03-04 12:32:29.597988"], ["id", 8]]

  def destroy
    @info = Information.find(params[:id])
    @info.destroy!
---
SELECT  "information".* FROM "information" WHERE "information"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "information" WHERE "information"."id" = ?  [["id", 2]]

  def show
    @info = Information.find(params[:id])
---
SELECT  "information".* FROM "information" WHERE "information"."id" = ? LIMIT 1  [["id", 2]]