app/controllers/results_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def new
    @user = User.find(params[:format])

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "results".* FROM "results" WHERE "results"."user_id" = ?  ORDER BY created_at DESC LIMIT 4 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "results" WHERE "results"."user_id" = ?  [["user_id", 1]]
---
  def show
    if current_user.admin?
      @user = User.find(params[:id])
      @result = @user.results.page(params[:page]).per(PER).order('created_at DESC')