app/controllers/tickets_controller.rb

SELECT  "information".* FROM "information" WHERE "information"."id" = ? LIMIT 1  [["id", nil]]
---
  def index
    @info = Information.find(params[:information_id])

INSERT INTO "tickets" ("user_id", "information_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["information_id", 3], ["comment", "hdfhfdh"], ["created_at", "2016-03-01 14:10:44.232423"], ["updated_at", "2016-03-01 14:10:44.232423"]]
---
  def create
    ticket = current_user.tickets.build do |t|
      t.information_id = params[:information_id]
      t.comment = params[:ticket][:comment]
    end
    if ticket.save

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."user_id" = ? AND "tickets"."information_id" = ? LIMIT 1  [["user_id", 2], ["information_id", 3]]
DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 1]]
---
  def destroy
    ticket = current_user.tickets.find_by!(information_id: params['information_id'])
    ticket.destroy!