app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @user = User.page(params[:page]).per(PER).all