app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "tickets".* FROM "tickets" WHERE "tickets"."user_id" = ? AND ("tickets"."created_at" >= '2016-03-04 00:00:00.000000' AND "tickets"."created_at" < '2016-03-11 00:00:00.000000')  ORDER BY "tickets"."created_at" DESC  [["user_id", 2]]
---
  def show
    if current_user.admin?
      @user = User.find(params[:id])
    else
      @user = current_user
      from = Time.now.at_beginning_of_day - 30.day
      to = from + 60.day
      @tickets = current_user.tickets.where(created_at: from...to).order(created_at: :desc)

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
UPDATE "users" SET "grade" = ?, "school_name" = ?, "authenticated" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["grade", "中１"], ["school_name", ""], ["authenticated", "t"], ["updated_at", "2016-03-03 15:16:38.758998"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)